{
  "class_name": "Sequential",
  "keras_version": "1.1.2",
  "config": [
    {
      "class_name": "Convolution2D",
      "config": {
        "activity_regularizer": null,
        "input_dtype": "float32",
        "b_regularizer": null,
        "W_constraint": null,
        "batch_input_shape": [
          null,
          32,
          32,
          3
        ],
        "nb_col": 3,
        "nb_filter": 32,
        "init": "glorot_uniform",
        "name": "convolution2d_1",
        "nb_row": 3,
        "trainable": true,
        "dim_ordering": "tf",
        "border_mode": "same",
        "W_regularizer": {
          "l1": 0,
          "l2": 0.0010000000474974513,
          "name": "WeightRegularizer"
        },
        "subsample": [
          1,
          1
        ],
        "bias": true,
        "activation": "relu",
        "b_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "dim_ordering": "tf",
        "border_mode": "valid",
        "strides": [
          2,
          2
        ],
        "name": "maxpooling2d_1",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "activity_regularizer": null,
        "W_regularizer": {
          "l1": 0,
          "l2": 0.0010000000474974513,
          "name": "WeightRegularizer"
        },
        "b_regularizer": null,
        "W_constraint": null,
        "nb_col": 3,
        "nb_filter": 64,
        "init": "glorot_uniform",
        "name": "convolution2d_2",
        "nb_row": 3,
        "trainable": true,
        "dim_ordering": "tf",
        "border_mode": "same",
        "activation": "relu",
        "subsample": [
          1,
          1
        ],
        "bias": true,
        "b_constraint": null
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "activity_regularizer": null,
        "W_regularizer": {
          "l1": 0,
          "l2": 0.0010000000474974513,
          "name": "WeightRegularizer"
        },
        "b_regularizer": null,
        "W_constraint": null,
        "nb_col": 3,
        "nb_filter": 64,
        "init": "glorot_uniform",
        "name": "convolution2d_3",
        "nb_row": 3,
        "trainable": true,
        "dim_ordering": "tf",
        "border_mode": "same",
        "activation": "relu",
        "subsample": [
          1,
          1
        ],
        "bias": true,
        "b_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "trainable": true,
        "dim_ordering": "tf",
        "border_mode": "valid",
        "strides": [
          2,
          2
        ],
        "name": "maxpooling2d_2",
        "pool_size": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "W_regularizer": null,
        "b_regularizer": null,
        "W_constraint": null,
        "output_dim": 512,
        "init": "glorot_uniform",
        "name": "hidden1",
        "trainable": true,
        "activation": "relu",
        "input_dim": null,
        "bias": true,
        "b_constraint": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "trainable": true,
        "p": 0.5,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "activity_regularizer": null,
        "W_regularizer": null,
        "b_regularizer": null,
        "W_constraint": null,
        "output_dim": 18,
        "init": "glorot_uniform",
        "name": "new-output",
        "trainable": true,
        "activation": "softmax",
        "input_dim": null,
        "bias": true,
        "b_constraint": null
      }
    }
  ]
}
